app/controllers/application_controller.rb

    def visit_count
        session[:visit] ||= 0
        session[:visit] += 1
        visits = Visit.first
        vc = visits.id
        if session[:visit] == 1
            vc += 1
            visits.update(:id => vc)
---
SELECT "visits".* FROM "visits" ORDER BY "visits"."vid" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "visits" SET "id" = $1, "updated_at" = $2 WHERE "visits"."id" = $3  [["id", 1], ["updated_at", "2022-01-16 07:15:58.600959"], ["id", 0]]