app/controllers/course_controller.rb

SELECT "courses".* FROM "courses"
---
    def ucourse
        @courses = Course.all

SELECT "courses".* FROM "courses"
---
    def mcourser
        if session[:member]
            @courses = Course.all

INSERT INTO "courses" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "hujg"], ["description", "bhjb"], ["created_at", "2022-04-11 18:30:32.741878"], ["updated_at", "2022-04-11 18:30:32.741878"]]
---
    def mcoursecp
        course = Course.new(:name => params[:name], :cname => params[:cname], :description => params[:description], :image => params[:image])
        course.save