app/controllers/event_controller.rb

    def uevent
        @events = Event.all
---
SELECT "events".* FROM "events"

    def meventr
        if session[:member]
            @events = Event.all
---
SELECT "events".* FROM "events"

    def meventcp
        event = Event.new(:name => params[:name], :info => params[:info], :image => params[:image])
        event.save
---
INSERT INTO "events" ("name", "info", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fh"], ["info", "fh"], ["created_at", "2022-04-11 18:13:58.380576"], ["updated_at", "2022-04-11 18:13:58.380576"]]

    def meventu
        if session[:member]
            @id = params[:id]
            @event = Event.find_by(id: @id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def meventdp
        if session[:member]
            event = Event.find(params[:id])
            event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]