app/controllers/game_controller.rb

SELECT "games".* FROM "games"
---
    def ugame
        @games = Game.all

SELECT "games".* FROM "games"
---
    def mgamer
        if session[:member]
            @games = Game.all

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def mgameu
        if session[:member]
            @sr = params[:id]
            @game = Game.find_by(id: @sr)

INSERT INTO "games" ("name", "info", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "abracadabra"], ["info", "hulalahulala"], ["created_at", "2022-05-12 06:47:52.657191"], ["updated_at", "2022-05-12 06:47:52.657191"]]
---
    def mgamecp
        game = Game.new(:name => params[:name], :info => params[:info])
        game.save

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 1]]
---
    def mgamedp
        game = Game.find(params[:id])
        game.destroy

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "games" SET "info" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["info", "sdfsd gdhg hfff\r\n"], ["updated_at", "2022-04-03 18:23:51.113017"], ["id", 3]]
---
    def mgameup
        game = Game.find(params[:id])
        game.update(:name => params[:name], :info => params[:info])