app/controllers/logging_controller.rb

    def newp
        ifmoru = session[:moru] == "member" ? true : false
        moru = ifmoru ? Member.find_by(email: params[:email]) : User.find_by(email: params[:email])
---
SELECT "members".* FROM "members" WHERE "members"."email" = $1 LIMIT $2  [["email", "mohak_k@ph.iitr.ac.in"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user1@gmail.com"], ["LIMIT", 1]]

    def loginp
        ifmoru = session[:moru] == "member" ? true : false
        moru = ifmoru ? Member.find_by(email: params[:email]) : User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user1@gmail.com"], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."email" = $1 LIMIT $2  [["email", "sanskritclub@iitr.ac.in"], ["LIMIT", 1]]