app/controllers/logging_controller.rb

    def loginp
        moru = session[:moru] == "member" ? true : false
        @moru = moru ? Member.find_by(email: params[:email]) : User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user1@gmail.com"], ["LIMIT", 1]]