app/controllers/logging_controller.rb

SELECT "members".* FROM "members" WHERE "members"."email" = $1 LIMIT $2  [["email", "mohak_k@ph.iitr.ac.in"], ["LIMIT", 1]]
---
    def login
        if Member.find_by(email: params[:email])
            if Member.find_by(email: params[:email]).password == params[:password]