app/controllers/shlok_controller.rb

    def ushlok
        @shloks = Shlok.all
---
SELECT "shloks".* FROM "shloks"

    def mshlokr
        if session[:member]
            @shloks = Shlok.all
---
SELECT "shloks".* FROM "shloks"

    def mshlokcp
        shlok = Shlok.new(:title => params[:title], :shlok => params[:shlok], :translation => params[:translation],
                            :updated_by => session[:email], :audio => params[:audio])
        shlok.save
---
INSERT INTO "shloks" ("title", "shlok", "translation", "updated_by") VALUES ($1, $2, $3, $4) RETURNING "sid"  [["title", "a"], ["shlok", "b"], ["translation", "c"], ["updated_by", "Mohak"]]

    def mshloku
        if session[:member]
            @shlok = Shlok.find(params[:id])
---
SELECT "shloks".* FROM "shloks" WHERE "shloks"."sid" = $1 LIMIT $2  [["sid", nil], ["LIMIT", 1]]

    def mshlokup
        shlok = Shlok.find(params[:id])
        pp = params[:shlok]
        shlok.update(:title => pp[:title], :shlok => pp[:shlok], :translation => pp[:translation],
                        :updated_by => session[:email])
---
SELECT "shloks".* FROM "shloks" WHERE "shloks"."sid" = $1 LIMIT $2  [["sid", nil], ["LIMIT", 1]]
UPDATE "shloks" SET "shlok" = $1, "updated_at" = $2 WHERE "shloks"."id" = $3  [["shlok", "मा निषाद प्रतिष्ठां त्वम्\r\nअगमः शाश्वतिः समाः |\r\nयत् क्रॉञ्चमिथुनादेकम्\r\nअवधिः काममोहितम् ||"], ["updated_at", "2022-05-14 06:29:08.565701"], ["id", 1]]

    def mshlokdp
        if session[:member]
            shlok = Shlok.find(params[:id])
            shlok.destroy
---
SELECT "shloks".* FROM "shloks" WHERE "shloks"."sid" = $1 LIMIT $2  [["sid", 4], ["LIMIT", 1]]
DELETE FROM "shloks" WHERE "shloks"."sid" = $1  [["sid", 4]]