app/controllers/shlok_controller.rb

    def rshlok
        @shloks = Shlok.all
---
SELECT "shloks".* FROM "shloks"

    def ashlokr
        if session[:admin]
            @shloks = Shlok.all
---
SELECT "shloks".* FROM "shloks"

    def ashlokcp
        shlok = Shlok.new(:title => params[:title], :shlok => params[:shlok], :translation => params[:translation])
        shlok.save
---
INSERT INTO "shloks" ("title", "shlok", "translation") VALUES ($1, $2, $3) RETURNING "sid"  [["title", "ALLITERATION"], ["shlok", "विभूषितानङ्गरिपूत्तमाङ्गा"], ["translation", "[:translation]"]]

    def ashloku
        if session[:admin]
            @id = :id
            @shlok = Shlok.find_by(sid: @id)
---
SELECT "shloks".* FROM "shloks" WHERE "shloks"."sid" = $1 LIMIT $2  [["sid", nil], ["LIMIT", 1]]

    def ashlokup
        shlok = Shlok.find(:id)
        shlok.update(:title => params[:title], :shlok => params[:shlok], :translation => params[:translation])
---
SELECT "shloks".* FROM "shloks" WHERE "shloks"."sid" = $1 LIMIT $2  [["sid", nil], ["LIMIT", 1]]
UPDATE "shloks" SET "shlok" = $1 WHERE "shloks"."sid" = $2  [["shlok", "राज्याभिषेके मदविह्वलायाः<br/> हस्ताच्च्युतोS हेमघटस्तरुण्याः |<br/> सोपानमासाद्य करोति शब्दम्<br/> ठं ठं ठठं ठं ठठठं ठठं ठः||"], ["sid", 3]]

    def ashlokdp
        shlok = Shlok.find(:id)
        shlok.destroy
---
SELECT "shloks".* FROM "shloks" WHERE "shloks"."sid" = $1 LIMIT $2  [["sid", 1], ["LIMIT", 1]]
DELETE FROM "shloks" WHERE "shloks"."sid" = $1  [["sid", 1]]