app/controllers/user_controller.rb

SELECT COUNT(*) FROM "users"
---
    def muserr
        if session[:member]
            @users = User.where(nil)
            keys = ["regid", "country", "state", "pin", "gender", "age", "sanslevel", "acadqual"]
            for i in keys
                @users = @users.filter_by_(i.to_sym, '%'+params[i]+'%') if params[i].present?
                # @users = @users.filter_by_(regid, params[:regid]) if params[:regid].present?
                # @users = @users.filter_by_(country, params[:country]) if params[:country].present?
                # @users = @users.filter_by_(state, params[:state]) if params[:state].present?
                # @users = @users.filter_by_(pin, params[:pin]) if params[:pin].present?
                # @users = @users.filter_by_(gender, params[:gender]) if params[:gender].present?
                # @users = @users.filter_by_(age, params[:age]) if params[:age].present?
                # @users = @users.filter_by_(sanslevel, params[:sanslevel]) if params[:sanslevel].present?
                # @users = @users.filter_by_(acadqual, params[:acadqual]) if params[:acadqual].present?
            end
            @count = @users.count