app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user1@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (mohak_k@ph.iitr.ac.in) LIMIT $1  [["LIMIT", 1]]
---
    def profile
        if session[:user]
            @user = User.find_by(email: session[:email])
            @profile = false
            if User.column_names.include? 'profile'

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mohak_k@ph.iitr.ac.in"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dev"], ["email", "dev_rj@ece.iitr.ac.in"], ["password", "mypass"], ["created_at", "2022-01-16 07:40:11.535549"], ["updated_at", "2022-01-16 07:40:11.535549"]]
---
    def newp
        if User.find_by(email: params[:email])
            flash[:notice] = "Email already registered."
            redirect_to new_path
        else
            if params[:password] == params[:repass]
                user = User.new(:name => params[:name], :email => params[:email], :password => params[:password])
                user.save

SELECT "users".* FROM "users"
---
    def muserr
        if session[:member]
            @users = User.all