app/controllers/welcome_controller.rb

    def home
        @news = Announcement.all
---
SELECT "announcements".* FROM "announcements"

    def mhomer
        if session[:member]
            @news = Announcement.all
---
SELECT "announcements".* FROM "announcements"

    def mhomeu
        if session[:member]
            @news = Announcement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def mannouncementcp
        news = Announcement.new(:news => params[:news])
        news.save
---
INSERT INTO "announcements" ("news", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["news", "sdvdsv"], ["created_at", "2022-05-14 09:18:12.628219"], ["updated_at", "2022-05-14 09:18:12.628219"]]

    def mannouncementup
        news = Announcement.find(params[:id])
        news.update(:news => params[:announcement][:news])
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "announcements" SET "news" = $1, "updated_at" = $2 WHERE "announcements"."id" = $3  [["news", "hell"], ["updated_at", "2022-05-14 09:45:12.935963"], ["id", 1]]